<a href="https://colab.research.google.com/github/priyanka36/MLProblems/blob/main/DATAMANIPULATION_PANDAS.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                       'B': ['B0', 'B1', 'B2', 'B3'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                       index=[0, 1, 2, 3])

In [2]:
import pandas as pd

In [17]:
df2 = pd.DataFrame({'A':['A5','A6','A7','A8'],"B":['B5','B6','B7','B8'],'C': ['C5', 'C6', 'C7', 'C8'],'D': ['D5', 'D6', 'D7', 'D8']},index=[4,5,6,7])

In [18]:
frames = [df1, df2]

In [23]:
result = pd.concat(frames,join='inner')

In [24]:
print(result)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A5  B5  C5  D5
5  A6  B6  C6  D6
6  A7  B7  C7  D7
7  A8  B8  C8  D8

In [25]:
df1 = pd.DataFrame([[1,2,3,4], [6,7,8,9]], columns=['D', 'B', 'E', 'A'], index=[1,2])
df2 = pd.DataFrame([[10,20,30,40], [60,70,80,90], [600,700,800,900]], columns=['A', 'B', 'C', 'D'], index=[2,3,4])

In [26]:
df1

   D  B  E  A
1  1  2  3  4
2  6  7  8  9

In [27]:
df2

     A    B    C    D
2   10   20   30   40
3   60   70   80   90
4  600  700  800  900

In [30]:
a1, a2 = df1.align(df2, join='outer', axis=0)
print(a1)
print(a2)

     D    B    E    A
1  1.0  2.0  3.0  4.0
2  6.0  7.0  8.0  9.0
3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN
       A      B      C      D
1    NaN    NaN    NaN    NaN
2   10.0   20.0   30.0   40.0
3   60.0   70.0   80.0   90.0
4  600.0  700.0  800.0  900.0

In [29]:
a4,a5 = df1.align(df2,join="inner",axis=1)
print(a4)
print(a5)

   D  B  A
1  1  2  4
2  6  7  9
     D    B    A
2   40   20   10
3   90   70   60
4  900  700  600

In [31]:
a6, a7 = df2.align(df1, join='outer', axis=0)
print(a6)
print(a7)

       A      B      C      D
1    NaN    NaN    NaN    NaN
2   10.0   20.0   30.0   40.0
3   60.0   70.0   80.0   90.0
4  600.0  700.0  800.0  900.0
     D    B    E    A
1  1.0  2.0  3.0  4.0
2  6.0  7.0  8.0  9.0
3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN

In [32]:
import numpy as np 
import matplotlib.pyplot as plt 
import pandas as pd

In [33]:
df1 = pd.read_csv('/content/restaurant-1-orders.csv')

In [34]:
df1

       Order Number        Order Date  ... Product Price  Total products
0             16118  03/08/2019 20:25  ...          0.80               6
1             16118  03/08/2019 20:25  ...         12.95               6
2             16118  03/08/2019 20:25  ...          2.95               6
3             16118  03/08/2019 20:25  ...          3.95               6
4             16118  03/08/2019 20:25  ...          8.95               6
...             ...               ...  ...           ...             ...
74813          2518  18/05/2016 18:53  ...         17.95               7
74814          2503  14/05/2016 19:28  ...         17.95               6
74815          2467  10/05/2016 13:18  ...         17.95               9
74816          2249  07/04/2016 19:04  ...         17.95               6
74817          1403  02/10/2015 17:29  ...         17.95               9

[74818 rows x 6 columns]

In [36]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74818 entries, 0 to 74817
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Order Number    74818 non-null  int64
 1   Order Date      74818 non-null  object
 2   Item Name       74818 non-null  object
 3   Quantity        74818 non-null  int64
 4   Product Price   74818 non-null  float64
 5   Total products  74818 non-null  int64
dtypes: float64(1), int64(3), object(2)
memory usage: 3.4+ MB

# By default the date column is read as an object data type when loading data from a CSV file.
 - To read the date column correctly, we can use the argument parse_dates to specify a list of date columns

In [39]:
df2 = pd.read_csv('/content/restaurant-1-orders.csv', parse_dates=['Order Date'])
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74818 entries, 0 to 74817
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Order Number    74818 non-null  int64
 1   Order Date      74818 non-null  datetime64[ns]
 2   Item Name       74818 non-null  object
 3   Quantity        74818 non-null  int64
 4   Product Price   74818 non-null  float64
 5   Total products  74818 non-null  int64
dtypes: datetime64[ns](1), float64(1), int64(3), object(1)
memory usage: 3.4+ MB

In [40]:
df2.head()

   Order Number          Order Date  ... Product Price  Total products
0         16118 2019-03-08 20:25:00  ...          0.80               6
1         16118 2019-03-08 20:25:00  ...         12.95               6
2         16118 2019-03-08 20:25:00  ...          2.95               6
3         16118 2019-03-08 20:25:00  ...          3.95               6
4         16118 2019-03-08 20:25:00  ...          8.95               6

[5 rows x 6 columns]

In [41]:
df1.head()

   Order Number        Order Date  ... Product Price  Total products
0         16118  03/08/2019 20:25  ...          0.80               6
1         16118  03/08/2019 20:25  ...         12.95               6
2         16118  03/08/2019 20:25  ...          2.95               6
3         16118  03/08/2019 20:25  ...          3.95               6
4         16118  03/08/2019 20:25  ...          8.95               6

[5 rows x 6 columns]

# Day first format (DD/MM, DD MM or, DD-MM) 
- By default, the argument parse_dates will read date data with month first (MM/DD, MM DD, or MM-DD) format, and this arrangement is relatively unique in the United State.
- In most of the rest of the world, the day is written first (DD/MM, DD MM, or DD-MM). If you would like Pandas to consider day first instead of month, you can set the argument dayfirst to True

In [42]:
pd.read_csv('/content/restaurant-1-orders.csv', 
            parse_dates=['Order Date'], 
            dayfirst=True)

       Order Number          Order Date  ... Product Price  Total products
0             16118 2019-08-03 20:25:00  ...          0.80               6
1             16118 2019-08-03 20:25:00  ...         12.95               6
2             16118 2019-08-03 20:25:00  ...          2.95               6
3             16118 2019-08-03 20:25:00  ...          3.95               6
4             16118 2019-08-03 20:25:00  ...          8.95               6
...             ...                 ...  ...           ...             ...
74813          2518 2016-05-18 18:53:00  ...         17.95               7
74814          2503 2016-05-14 19:28:00  ...         17.95               6
74815          2467 2016-05-10 13:18:00  ...         17.95               9
74816          2249 2016-04-07 19:04:00  ...         17.95               6
74817          1403 2015-10-02 17:29:00  ...         17.95               9

[74818 rows x 6 columns]

# 3. Combining multiple columns to a datetime
- Sometimes date is split up into multiple columns, for example, year, month, and day

In [46]:
pd.read_csv('/content/data_2.csv')

   year  month  day product  price
0  2019      1    1       A     10
1  2019      1    2       B     20
2  2019      1    3       C     30
3  2019      1    4       D     40

In [48]:
pd.read_csv('/content/data_2.csv',parse_dates=[['year','month','day']])

  year_month_day product  price
0     2019-01-01       A     10
1     2019-01-02       B     20
2     2019-01-03       C     30
3     2019-01-04       D     40

# Notice that the column name year_month_day is generated automatically. To specify a custom column name, we can pass a dictionary instead.

In [49]:
pd.read_csv('/content/data_2.csv',parse_dates= {'date':['day','month','year']})

        date product  price
0 2019-01-01       A     10
1 2019-02-01       B     20
2 2019-03-01       C     30
3 2019-04-01       D     40

# pandas.DatetimeIndex.to_period

In [50]:
df3 = pd.DataFrame({"y":[1,2,3]},index=pd.to_datetime(["2000-03-31 00:00:00",
                                        "2000-05-31 00:00:00",
                                        "2000-08-31 00:00:00"]))

In [51]:
df3

            y
2000-03-31  1
2000-05-31  2
2000-08-31  3

In [53]:
df3.index.to_period("M")

PeriodIndex(['2000-03', '2000-05', '2000-08'], dtype='period[M]', freq='M')

In [59]:
df3.index.to_period("M")

PeriodIndex(['2000-03', '2000-05', '2000-08'], dtype='period[M]', freq='M')

In [56]:
df3

            y
2000-03-31  1
2000-05-31  2
2000-08-31  3